[Killed] ConditionalExpression
src/Analysis.ts:36:9
       throw new Error("cannot vote on your own analysis")
     }
 
-    if (!this.inProgress()) {
+    if (false) {
       throw new Error("You cannot vote on this analysis since its already done")
     }
killedBy: analysis adding a vote cannot vote when the analysis is not in a pending state
statusReason: Error: expect(received).toThrowError()

Received function did not throw

[Killed] ConditionalExpression
src/Analysis.ts:48:12
   }
 
   private isOwner(vote: Vote): boolean {
-    return this.userId === vote.userId
+    return false
   }
 
killedBy: analysis adding a vote cannot vote when owner
statusReason: Error: expect(received).toThrowError()

Received function did not throw
