[Killed] BlockStatement
src/Analysis.ts:15:39
   public readonly status: AnalysisStatus
   public readonly userId: string
 
-  public get votes(): readonly Vote[] {
-    return this._votes
-  }
+  public get votes(): readonly Vote[] {}
 
   public constructor(
killedBy: vote on analysis use case adds a vote
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"votes": [{"type": 0, "userId": "userId"}]}
Received: {"_votes": [{"type": 0, "userId": "userId"}], "id": "id", "status": 0, "userId": "john"}

Number of calls: 1

[Killed] BlockStatement
src/Analysis.ts:24:5
     votes: Vote[],
     userId: string,
     status: AnalysisStatus
-  ) {
-    this.id = id
-    this._votes = votes
-    this.userId = userId
-    this.status = status
-  }
+  ) {}
 
   public vote(vote: Vote): void {
killedBy: vote on analysis use case adds a vote
statusReason: Error: You cannot vote on this analysis since its already done

[Killed] BlockStatement
src/Analysis.ts:31:33
     this.status = status
   }
 
-  public vote(vote: Vote): void {
-    if (this.isOwner(vote)) {
-      throw new Error("cannot vote on your own analysis")
-    }
-
-    if (!this.inProgress()) {
-      throw new Error("You cannot vote on this analysis since its already done")
-    }
-
-    if (this.hasAlreadyVoted(vote)) {
-      throw new Error("You already voted")
-    }
-
-    this._votes.push(vote)
-  }
+  public vote(vote: Vote): void {}
 
   private isOwner(vote: Vote): boolean {
killedBy: vote on analysis use case adds a vote
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"votes": [{"type": 0, "userId": "userId"}]}
Received: {"_votes": [], "id": "id", "status": 0, "userId": "john"}

Number of calls: 1

[Killed] ConditionalExpression
src/Analysis.ts:32:9
   }
 
   public vote(vote: Vote): void {
-    if (this.isOwner(vote)) {
+    if (true) {
       throw new Error("cannot vote on your own analysis")
     }
killedBy: vote on analysis use case adds a vote
statusReason: Error: cannot vote on your own analysis

[NoCoverage] BlockStatement
src/Analysis.ts:32:29
   }
 
   public vote(vote: Vote): void {
-    if (this.isOwner(vote)) {
-      throw new Error("cannot vote on your own analysis")
-    }
+    if (this.isOwner(vote)) {}
 
     if (!this.inProgress()) {

[Killed] ConditionalExpression
src/Analysis.ts:36:9
       throw new Error("cannot vote on your own analysis")
     }
 
-    if (!this.inProgress()) {
+    if (true) {
       throw new Error("You cannot vote on this analysis since its already done")
     }
killedBy: vote on analysis use case adds a vote
statusReason: Error: You cannot vote on this analysis since its already done

[Killed] BooleanLiteral
src/Analysis.ts:36:9
       throw new Error("cannot vote on your own analysis")
     }
 
-    if (!this.inProgress()) {
+    if (this.inProgress()) {
       throw new Error("You cannot vote on this analysis since its already done")
     }
killedBy: vote on analysis use case adds a vote
statusReason: Error: You cannot vote on this analysis since its already done

[NoCoverage] StringLiteral
src/Analysis.ts:37:23
     }
 
     if (!this.inProgress()) {
-      throw new Error("You cannot vote on this analysis since its already done")
+      throw new Error("")
     }
 

[Killed] ConditionalExpression
src/Analysis.ts:40:9
       throw new Error("You cannot vote on this analysis since its already done")
     }
 
-    if (this.hasAlreadyVoted(vote)) {
+    if (true) {
       throw new Error("You already voted")
     }
killedBy: vote on analysis use case adds a vote
statusReason: Error: You already voted

[NoCoverage] BlockStatement
src/Analysis.ts:40:37
       throw new Error("You cannot vote on this analysis since its already done")
     }
 
-    if (this.hasAlreadyVoted(vote)) {
-      throw new Error("You already voted")
-    }
+    if (this.hasAlreadyVoted(vote)) {}
 
     this._votes.push(vote)

[NoCoverage] StringLiteral
src/Analysis.ts:41:23
     }
 
     if (this.hasAlreadyVoted(vote)) {
-      throw new Error("You already voted")
+      throw new Error("")
     }
 

[Survived] BlockStatement
src/Analysis.ts:47:40
     this._votes.push(vote)
   }
 
-  private isOwner(vote: Vote): boolean {
-    return this.userId === vote.userId
-  }
+  private isOwner(vote: Vote): boolean {}
 
   private hasAlreadyVoted(voter: Vote): boolean {

[Killed] ConditionalExpression
src/Analysis.ts:48:12
   }
 
   private isOwner(vote: Vote): boolean {
-    return this.userId === vote.userId
+    return true
   }
 
killedBy: vote on analysis use case adds a vote
statusReason: Error: cannot vote on your own analysis

[Killed] EqualityOperator
src/Analysis.ts:48:12
   }
 
   private isOwner(vote: Vote): boolean {
-    return this.userId === vote.userId
+    return this.userId !== vote.userId
   }
 
killedBy: vote on analysis use case adds a vote
statusReason: Error: cannot vote on your own analysis

[Survived] BlockStatement
src/Analysis.ts:51:49
     return this.userId === vote.userId
   }
 
-  private hasAlreadyVoted(voter: Vote): boolean {
-    return this._votes.some((vote) => vote.isOwner(voter))
-  }
+  private hasAlreadyVoted(voter: Vote): boolean {}
 
   private inProgress(): boolean {

[Killed] MethodExpression
src/Analysis.ts:52:12
   }
 
   private hasAlreadyVoted(voter: Vote): boolean {
-    return this._votes.some((vote) => vote.isOwner(voter))
+    return this._votes.every(vote => vote.isOwner(voter))
   }
 
killedBy: vote on analysis use case adds a vote
statusReason: Error: You already voted

[Survived] ArrowFunction
src/Analysis.ts:52:29
   }
 
   private hasAlreadyVoted(voter: Vote): boolean {
-    return this._votes.some((vote) => vote.isOwner(voter))
+    return this._votes.some(() => undefined)
   }
 

[Killed] BlockStatement
src/Analysis.ts:55:33
     return this._votes.some((vote) => vote.isOwner(voter))
   }
 
-  private inProgress(): boolean {
-    return this.status === AnalysisStatus.Pending
-  }
+  private inProgress(): boolean {}
 }
 
killedBy: vote on analysis use case adds a vote
statusReason: Error: You cannot vote on this analysis since its already done

[Killed] ConditionalExpression
src/Analysis.ts:56:12
   }
 
   private inProgress(): boolean {
-    return this.status === AnalysisStatus.Pending
+    return false
   }
 }
killedBy: vote on analysis use case adds a vote
statusReason: Error: You cannot vote on this analysis since its already done

[Killed] EqualityOperator
src/Analysis.ts:56:12
   }
 
   private inProgress(): boolean {
-    return this.status === AnalysisStatus.Pending
+    return this.status !== AnalysisStatus.Pending
   }
 }
killedBy: vote on analysis use case adds a vote
statusReason: Error: You cannot vote on this analysis since its already done
