[NoCoverage] BlockStatement
src/Vote.ts:12:39
     public readonly userId: string
   ) {}
 
-  public isOwner(vote: Vote): boolean {
-    return this.userId === vote.userId
-  }
+  public isOwner(vote: Vote): boolean {}
 }
 

[NoCoverage] EqualityOperator
src/Vote.ts:13:12
   ) {}
 
   public isOwner(vote: Vote): boolean {
-    return this.userId === vote.userId
+    return this.userId !== vote.userId
   }
 }

[NoCoverage] ConditionalExpression
src/Vote.ts:13:12
   ) {}
 
   public isOwner(vote: Vote): boolean {
-    return this.userId === vote.userId
+    return false
   }
 }

[Killed] BlockStatement
src/Vote.ts:18:46
 }
 
 export class VoteFactory {
-  public static agreed(userId: string): Vote {
-    return new Vote(VoteType.Agreed, userId)
-  }
+  public static agreed(userId: string): Vote {}
 
   public static disagreed(userId: string): Vote {
killedBy: vote on analysis use case adds a vote
statusReason: TypeError: Cannot read properties of undefined (reading 'userId')

[NoCoverage] BlockStatement
src/Vote.ts:22:49
     return new Vote(VoteType.Agreed, userId)
   }
 
-  public static disagreed(userId: string): Vote {
-    return new Vote(VoteType.Disagreed, userId)
-  }
+  public static disagreed(userId: string): Vote {}
 }
 
