[Killed] ConditionalExpression
src/VoteOnAnalysisUseCase.ts:27:9
   public async execute(input: IVoteOnAnalysisRequest): Promise<void> {
     const analysis = await this._analysisRepository.load(input.id)
 
-    if (analysis === null) {
+    if (true) {
       throw new AnalysisNotFoundException()
     }
killedBy: vote on analysis use case adds a vote
statusReason: Error:

[Killed] EqualityOperator
src/VoteOnAnalysisUseCase.ts:27:9
   public async execute(input: IVoteOnAnalysisRequest): Promise<void> {
     const analysis = await this._analysisRepository.load(input.id)
 
-    if (analysis === null) {
+    if (analysis !== null) {
       throw new AnalysisNotFoundException()
     }
killedBy: vote on analysis use case adds a vote
statusReason: Error:
